{
    "id": "r-1",
    "name": "Mountain Dwarf",
    "description": "As a mountain dwarf, you're strong and hardy, accustomed to a difficult life in rugged terrain. You're probably on the tall side (for a dwarf), and tend toward lighter coloration, The shield dwarves of northern Faerun, as well as the ruling Hylar clan and the noble Daewar clan of Dragonlance, are mountain dwarves.",
    "features": [
        {
            "id": "feat-asi-con-2",
            "name": "Ability Score Increase (CON +2)",
            "description": "Your Constitution score increases by 2.",
            "trigger": "onAdd"

        },
        {
            "id": "speed-25-dwarf",
            "name": "Speed",
            "description": "Your base walking speed is 25 feet. Your speed is not reduced by heavy armor.",
            "trigger": "onAdd"

        },
        {
            "id": "darkvision-60",
            "name": "Darkvision",
            "description": "Accustomed to life undergound, you have superior vision in dark and dim conditions. You can see in dim light within 60ft of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
            "trigger": "onAdd"

        },
        {
            "id":"dwarf-resilience",
            "name": "Dwarvish Resilience",
            "description":"You have advantage on saving throws against poison, and you have resistance to poison damage.",
            "trigger": "onAdd"

        },
        {
            "id":"dwarf-weapon-prof",
            "name": "Dwarvish Weapon Training",
            "description": "You have profiency with the battleaxe, handaxe, light hammer, and warhammer.",
            "trigger": "onAdd"

        },
        {
            "id": "dwarf-tool-prof",
            "name": "Tool Proficiency",
            "description": "You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools.",
            "trigger": "onAdd"

        },
        {
            "id": "stonecunning",
            "name": "Stonecunning",
            "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
            "trigger": "onAdd"

        },
        {
            "id": "dwarf-lang",
            "name": "Languages",
            "description": "You can speak, read, and write Common and Dwarvish.",
            "trigger": "onAdd"

        },
        {
            "id": "feat-asi-str-2",
            "name": "Ability Score Increase (STR +2)",
            "description": "Your Strength score increases by 2.",
            "trigger": "onAdd"

        },
        {
            "id": "dwarf-armor-prof",
            "name": "Dwarvish Armor Training",
            "description": "You have profiency with light and medium armor.",
            "trigger": "onAdd"
            
        }
    ]
}